МебельДомТорг (День 12)/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товраы</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МебельДомТорг (День 12)/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТовраыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекущиеДанныеТовары = Элементы.Товраы.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество*ТекущиеДанныеТовары.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТовраыЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекущиеДанныеТовары = Элементы.Товраы.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Количество*ТекущиеДанныеТовары.Цена;
КонецПроцедуры
